In [ ]:
#To check the values under the file and change the null values

In [16]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

In [17]:
data=pd.read_csv("gapminder_internet.csv")

In [18]:
data.head()

       country  incomeperperson  internetuserate  urbanrate
0  Afghanistan              NaN         3.654122      24.04
1      Albania      1914.996551        44.989947      46.72
2      Algeria      2231.993335        12.500073      65.22
3      Andorra     21943.339900        81.000000      88.92
4       Angola      1381.004268         9.999954      56.70

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213 entries, 0 to 212
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          213 non-null    object
 1   incomeperperson  190 non-null    float64
 2   internetuserate  192 non-null    float64
 3   urbanrate        203 non-null    float64
dtypes: float64(3), object(1)
memory usage: 6.8+ KB

In [20]:
data.isnull().sum()

country             0
incomeperperson    23
internetuserate    21
urbanrate          10
dtype: int64

In [21]:
data.select_dtypes(include="float64")

     incomeperperson  internetuserate  urbanrate
0                NaN         3.654122      24.04
1        1914.996551        44.989947      46.72
2        2231.993335        12.500073      65.22
3       21943.339900        81.000000      88.92
4        1381.004268         9.999954      56.70
..               ...              ...        ...
208       722.807559        27.851822      27.84
209              NaN        36.422772      71.90
210       610.357367        12.349750      30.64
211       432.226337        10.124986      35.42
212       320.771890        11.500415      37.34

[213 rows x 3 columns]

In [22]:
data.select_dtypes(include="float64").isnull().sum()

incomeperperson    23
internetuserate    21
urbanrate          10
dtype: int64

In [23]:
data.select_dtypes(include="float64").columns

Index(['incomeperperson', 'internetuserate', 'urbanrate'], dtype='object')

In [24]:
for i in data.select_dtypes(include="float64").columns:
    data[i].fillna(data[i].mode()[0],inplace = True)

C:\Users\User\AppData\Local\Temp\ipykernel_15828\3103268174.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data[i].fillna(data[i].mode()[0],inplace = True)

In [25]:
data.isnull().sum()

country            0
incomeperperson    0
internetuserate    0
urbanrate          0
dtype: int64